Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/edc/ATSAML22N16A.PIC
      <edc:SFRDef edc:_addr="0x40001034" edc:access="------nn" edc:cname="DPLLPRESC" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="PRESC" edc:desc="Output Clock Prescaler" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="DPLL output is divided by 1" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="DPLL output is divided by 2" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="DPLL output is divided by 4" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001035" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001038" edc:access="----rrr-" edc:cname="DPLLSYNCBUSY" edc:impl="0xE" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DPLL Enable Synchronization Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLRATIO" edc:desc="DPLL Ratio Synchronization Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLPRESC" edc:desc="DPLL Prescaler Synchronization Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001039" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4000103C" edc:access="------rr" edc:cname="DPLLSTATUS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="DPLL Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:desc="DPLL Clock Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000103D" edc:offset="0x3C3"/>
      <edc:SFRDef edc:_addr="0x40001400" edc:access="-----------------------------n-n" edc:cname="INTENCLR" edc:impl="0x5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001404" edc:access="-----------------------------n-n" edc:cname="INTENSET" edc:impl="0x5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001408" edc:access="-----------------------------n-n" edc:cname="INTFLAG" edc:impl="0x5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000140C" edc:access="----------------------------rr-r" edc:cname="STATUS" edc:impl="0xD" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSW" edc:desc="XOSC32K Clock switch" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001410" edc:access="-----nnn" edc:cname="RTCCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="RTCSEL" edc:desc="RTC Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="ULP1K" edc:desc="1.024kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ULP32K" edc:desc="32.768kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="XOSC1K" edc:desc="1.024kHz from 32.768kHz external oscillator" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="32.768kHz from 32.768kHz external crystal oscillator" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001411" edc:access="-------n" edc:cname="SLCDCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="SLCDSEL" edc:desc="SLCD Clock Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001412" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x40001414" edc:access="---n-nnnnn-nnnn-" edc:cname="XOSC32K" edc:impl="0x17DE" edc:mclr="0000000010000000" edc:nzwidth="0x10" edc:por="0000000010000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:desc="Crystal Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:desc="32kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:desc="1kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Oscillator Start-Up Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62.5 ms" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125 ms" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500 ms" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000 ms" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE65536" edc:desc="2000 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE131072" edc:desc="4000 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE262144" edc:desc="8000 ms" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001416" edc:access="-----nnn" edc:cname="CFDCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="CFDEN" edc:desc="Clock Failure Detector Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWBACK" edc:desc="Clock Switch Back" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDPRESC" edc:desc="Clock Failure Detector Prescaler" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001417" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO" edc:desc="Clock Failure Detector Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001418" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4000141C" edc:access="----------------n--nnnnn-----nn-" edc:cname="OSCULP32K" edc:impl="0x9F06" edc:nzwidth="0x20" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:desc="Enable Out 32k" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:desc="Enable Out 1k" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:desc="Oscillator Calibration" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001420" edc:offset="0x3E0"/>
      <edc:SFRDef edc:_addr="0x40001800" edc:access="---------------------nnn--nnnnnn" edc:cname="INTENCLR" edc:impl="0x73F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:desc="BOD12 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:desc="BOD12 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:desc="BOD12 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:desc="Voltage Regulator Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:desc="Automatic Power Switch Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:desc="VDDCORE Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001804" edc:access="---------------------nnn--nnnnnn" edc:cname="INTENSET" edc:impl="0x73F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:desc="BOD12 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:desc="BOD12 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:desc="BOD12 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:desc="Voltage Regulator Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:desc="Automatic Power Switch Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:desc="VDDCORE Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
